DataProcessors/упРМВодителя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>упРМВодителя</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутевойЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упПутевойЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоРейсАктивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоРейсКВыполнению</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРейса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеМаршрута</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяОформлениеПутевогоЛиста</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПробегНачало</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Пробег</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПробегОкончание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Пробег</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>дрвРаботыПоТекущемуРейсу</Name>
					<Type>
						<v8:Type>v8:ValueTree</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>дрвРаботыПоТочке</Name>
					<Type>
						<v8:Type>v8:ValueTree</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПерваяТочка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПоследняяТочка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>дрвРаботыПоТекущемуРейсуЭталон</Name>
					<Type>
						<v8:Type>v8:ValueTree</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоРабот</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТекущейТочки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресаПогрузкиПоРейсу</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГСМ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидГСМ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упВидыГСМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачОстаток</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонОстаток</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Заправки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидГСМ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упВидыГСМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДвижения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упВидыДвиженияТоплива</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЗаправкиСлива</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриемникСливаГСМ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упДополнительноеОборудование</v8:Type>
								<v8:Type>cfg:CatalogRef.упСклады</v8:Type>
								<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГСМ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упГСМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/упРМВодителя/Forms/ФормаКонечныеДанныеПутевогоЛиста/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИспользуетсяГлобальнаяПодсистемаУправлениеПеревозками = ПолучитьФункциональнуюОпцию("упИспользуетсяГлобальнаяПодсистемаУправлениеПеревозками");
	текОбъект	= РеквизитФормыВЗначение("Объект");
	ЗаполнитьЗначенияСвойств(текОбъект, Параметры.Объект,,текОбъект.ПолучитьСтрокуНеПерезаполняемыхРеквизитов());
	текОбъект.ЗаполнитьГСМ();
	ЗначениеВРеквизитФормы(текОбъект, "Объект");
	ТекстДополнительногоСообщения 	= "" + Объект.ПутевойЛист;
	ТекстДополнительногоСообщения1 	= "" + Объект.ТранспортноеСредство;
	ТекстПодсказки = Нстр("ru = 'Введите конечные остатки по путевому листу'");
	
	ЭтоОстатки = Истина;
	ЗакрытьТекущуюФорму	= Ложь;
	ФормаЗаблокирована 	= Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Отказ = НЕ ЗакрытьТекущуюФорму;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КнопкаПодтвердитьНажатие(Элемент)
	Отказ = Ложь;
	ПодтвердитьПутевойЛист(Отказ);
	Если НЕ Отказ Тогда
		Если ИспользуетсяГлобальнаяПодсистемаУправлениеПеревозками Тогда
			текОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормы", ЭтотОбъект);
			сткПараметры	= Новый Структура();
			сткПараметры.Вставить("Объект", Объект);
			ОткрытьФорму("Обработка.упРМВодителя.Форма.ФормаИсполнениеТочек", сткПараметры,ЭтотОбъект,,Окно,,текОповещениеОЗакрытии);
		Иначе	
			ЗакрытьТекущуюФорму = Истина;
			Закрыть();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КнопкаДобавитьНажатие(Элемент)
	
	текОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормы", ЭтотОбъект);
	сткПараметры	= Новый Структура();
	сткПараметры.Вставить("ДобавитьСтроку", Истина);
	ОткрытьФорму("Обработка.упРМВодителя.Форма.ФормаВводаЗаправки", сткПараметры, ЭтотОбъект,, Окно,, текОповещениеОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаУдалитьНажатие(Элемент)
	ТекущаяСтрока = Элементы.Заправки.ТекущаяСтрока;
	Если НЕ ТекущаяСтрока = Неопределено Тогда
		Объект.Заправки.Удалить(Объект.Заправки.НайтиПоИдентификатору(ТекущаяСтрока));	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КнопкаРежимыНажатие(Элемент)
	ЭтоОстатки = НЕ ЭтоОстатки;
	Если ЭтоОстатки Тогда
		Элементы.ГруппаГСМ.ТекущаяСтраница = Элементы.ГруппаОстатки;	
		Элементы.КнопкаРежимы.ТекстНевыбраннойКартинки  = Нстр("ru = 'Заправки'");
	Иначе
		Элементы.КнопкаРежимы.ТекстНевыбраннойКартинки  = Нстр("ru = 'Остатки'");
		Элементы.ГруппаГСМ.ТекущаяСтраница = Элементы.ГруппаЗаправки;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаИзменитьНажатие(Элемент)
	ТекущиеДанные = Элементы.Заправки.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		текОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормы", ЭтотОбъект);
		сткПараметры	= Новый Структура();
		сткПараметры.Вставить("Количество", 		ТекущиеДанные.Количество);
		сткПараметры.Вставить("ВидГСМ", 			ТекущиеДанные.ВидГСМ);
		сткПараметры.Вставить("ВидДвижения", 		ТекущиеДанные.ВидДвижения);
		сткПараметры.Вставить("ДопОборудование", 	ТекущиеДанные.ДопОборудование);
		сткПараметры.Вставить("ДобавитьСтроку", 	Ложь);
		сткПараметры.Вставить("ДатаЗаправкиСлива", 	ТекущиеДанные.ДатаЗаправкиСлива);
		сткПараметры.Вставить("ПриемникСливаГСМ", 	ТекущиеДанные.ПриемникСливаГСМ);
		сткПараметры.Вставить("ГСМ", 				ТекущиеДанные.ГСМ);

		ОткрытьФорму("Обработка.упРМВодителя.Форма.ФормаВводаЗаправки", сткПараметры, ЭтотОбъект,, Окно,, текОповещениеОЗакрытии);
	КонецЕсли;
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура ПодтвердитьПутевойЛист(Отказ)
	текОбъект = РеквизитФормыВЗначение("Объект");
	текОбъект.ЗаполнитьКонечныеОстатки(ТекстОшибки, Отказ);
КонецПроцедуры

&НаКлиенте
// Процедура завершения после закрытия формы исполнения точек.
//
Процедура ОбработатьЗакрытиеФормы(Результат, ДополнительныеПараметры) Экспорт

	ИмяФормыПерехода 	= Неопределено;
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		сткРезультатПриЗакрытииФормы = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(Результат);
		
		Если сткРезультатПриЗакрытииФормы.Свойство("ИмяФормыПерехода", ИмяФормыПерехода) Тогда
			
		КонецЕсли;
		
		Если сткРезультатПриЗакрытииФормы.Свойство("Заправка") Тогда
			
			СтрокаЗаправки = Неопределено;
			Если сткРезультатПриЗакрытииФормы.ДобавитьСтроку Тогда
				СтрокаЗаправки = Объект.Заправки.Добавить();
			Иначе	
				СтрокаЗаправки = Элементы.Заправки.ТекущиеДанные;	
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(СтрокаЗаправки, сткРезультатПриЗакрытииФормы);
			
		КонецЕсли;
	КонецЕсли;
	
	мсвСоставИмениФормы = СтрРазделить(ИмяФормы, ".");
	ИмяТекущейФормы 	= мсвСоставИмениФормы[мсвСоставИмениФормы.ВГраница()];
	
	// При возвращении по стеку форм, анализируем имя текущей формы, если дошли до нужного.
	Если ИмяТекущейФормы = ИмяФормыПерехода Тогда
		Активизировать();
		ФормаЗаблокирована = Ложь;
	Иначе	
		ПодключитьОбработчикОжидания("ЗакрытьФормуОбработчикОжидания",0.1,Истина);
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаОчиститьКонечныйПробегНажатие(Элемент)
	Объект.ПробегОкончание = 0;
КонецПроцедуры

&НаКлиенте
Процедура КнопкаОчиститьОстаткиНажатие(Элемент)
	
	Для каждого СтрокаГСМ Из Объект.ГСМ Цикл
		
		СтрокаГСМ.КонОстаток = 0;
		
 	КонецЦикла;
	
КонецПроцедуры

#Область ПереходыМеждуФормами

&НаКлиенте
Процедура ЗакрытьФормуОбработчикОжидания() Экспорт
	ЗакрытьТекущуюФорму = Истина;
	Закрыть(сткРезультатПриЗакрытииФормы);
КонецПроцедуры

#КонецОбласти


#КонецОбласти
